src/cf/AccumulationRegisters/СтраховыеВзносыПереданныеВПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>СтраховыеВзносыПереданныеВПФР</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страховая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Накопительная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраховаяЧленамЭкипажейМорскихСудов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НакопительнаяЧленамЭкипажейМорскихСудов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КатегорияЗастрахованныхЛиц</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииЗастрахованныхЛицДляПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДоговоровСЗВ63</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияЗастрахованныхЛицУНФ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииЗастрахованныхЛицДляПФРУНФ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/СтраховыеВзносыПереданныеВПФР/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//{{MRG[ <-> ]
//
//}}MRG[ <-> ]
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
//{{MRG[ <-> ]
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(ФизическоеЛицо)";
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	|	ЗначениеРазрешено(Организация)";
//
//}}MRG[ <-> ]
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда	
		Возврат;		
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	СтраховыеВзносыПереданныеВПФР.НомерСтроки КАК НомерСтроки,
	|	СтраховыеВзносыПереданныеВПФР.ВидДвижения КАК ВидДвижения,
	|	СтраховыеВзносыПереданныеВПФР.Организация КАК Организация,
	|	СтраховыеВзносыПереданныеВПФР.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СтраховыеВзносыПереданныеВПФР.КатегорияЗастрахованныхЛицУНФ КАК КатегорияЗастрахованныхЛиц,
	|	СтраховыеВзносыПереданныеВПФР.Страховая КАК СтраховаяПередЗаписью,
	|	СтраховыеВзносыПереданныеВПФР.Страховая КАК СтраховаяИзменение,
	|	СтраховыеВзносыПереданныеВПФР.Страховая КАК СтраховаяПриЗаписи,
	|	СтраховыеВзносыПереданныеВПФР.Накопительная КАК НакопительнаяПередЗаписью,
	|	СтраховыеВзносыПереданныеВПФР.Накопительная КАК НакопительнаяИзменение,
	|	СтраховыеВзносыПереданныеВПФР.Накопительная КАК НакопительнаяПриЗаписи
	|ПОМЕСТИТЬ ДвиженияСтраховыеВзносыПереданныеВПФРИзменение
	|ИЗ
	|	РегистрНакопления.СтраховыеВзносыПереданныеВПФР КАК СтраховыеВзносыПереданныеВПФР");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияСтраховыеВзносыПереданныеВПФРИзменение", Ложь);
	
КонецПроцедуры // СоздатьПустуюВременнуюТаблицуИзменение()

#КонецОбласти

#КонецЕсли
